Autodesk.Revit.DB.Surface.GetBoundingBoxUV
Gets the UV bounding box of the surface.
Remarks:
The UV bounding box may not be set.
Returns:
The UV bounding box of the surface.
Since:
2021

Autodesk.Revit.DB.Surface.ProjectWithGuessPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV@,System.Double@)
Project a 3D point orthogonally onto a surface (to find the nearest point).
This method is meant to be used when a good approximate solution for the projection is available.
Throws InvalidOperationException if the projection fails.
point:
The point to project.
guessUV:
The calculation will look for a project near the provided UV.
uv:
The surface coordinates of the projected point.
distance:
Holds the distance from input point to its projection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The projection failed.
Since:
2018.1

Autodesk.Revit.DB.Surface.Project(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.UV@,System.Double@)
Project a 3D point orthogonally onto a surface (to find the nearest point).
Throws InvalidOperationException if the projection fails.
point:
The point to project.
uv:
The surface coordinates of the projected point.
distance:
Holds the distance from input point to its projection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The projection failed.
Since:
2018.1